ЧартерEDT.Расширение1/src/DataProcessors/ЗагрузкаДанныхБезЗаселения4Комната/ЗагрузкаДанныхБезЗаселения4Комната.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхБезЗаселения4Комната</name>
</mdclass:DataProcessor>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomInventory/RoomInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aeb81e75-04ad-4f43-868f-b8ea2669c5d7">
  <name>RoomInventory</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7187f02a-e01a-4fa4-a90d-ed9ace802a97">
    <name>Counter</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c26c8823-5255-4588-91ab-3f27f6c31ff5">
    <name>TotalRooms</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="78098442-cc9e-4761-848d-af64c2f5109f">
    <name>TotalBeds</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="357a8f84-1ec8-4df6-9544-5f74d86b72dc">
    <name>RoomsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="22789c75-f8a9-477f-9281-68c367895c20">
    <name>BedsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bd1ad0c3-3520-47a2-bdf8-f2fef29a4b16">
    <name>ExpectedRoomsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62777090-ae79-44c3-adca-787e958cc1e8">
    <name>ExpectedBedsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="971c16cd-9b59-45e8-819e-a9a3c7e36f30">
    <name>ExpectedGuestsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c1a65555-7280-42d8-953d-4784a4163e9f">
    <name>GuestsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0f95b9b2-b56a-4639-a4f1-fca810dc2b4c">
    <name>RoomsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d6674d8-44b4-44fb-b651-3f701f20e111">
    <name>RoomsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c4b4557e-9287-41d4-8e59-2df23edb9117">
    <name>BedsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ecdde1f9-5cf0-450e-9c85-240a41e21dc3">
    <name>IsInHouse</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2dd1591-19cc-42df-853b-928c89fabd9b">
    <name>IsAccommodation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bee4da2-3939-441c-b5f7-b1232729f041">
    <name>PeriodFrom</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b252a75-9287-4325-a6cb-0a88bdce9ca2">
    <name>PeriodTo</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46d7e314-d052-46d5-8347-a165acef5625">
    <name>Customer</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95181482-afb2-4654-9864-0ec98c2b823d">
    <name>GuestGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31da10c9-481a-48a5-ac2c-46a0315d7a6f">
    <name>Guest</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ecc1c4-80e9-4cf0-8d39-e9e904be978a">
    <name>CheckOutDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dda37713-d4e8-4591-886d-de3bfbcc0dad">
    <name>NumberOfPersons</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b999d1f7-084e-4966-935f-e9425a773bad">
    <name>IsCheckOut</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad21bcb0-f275-4cd5-aaa9-b4f0ac09f5e1">
    <name>IsReservation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="daff9aed-b7c8-4664-8fc9-8434ccd4dcad">
    <name>CheckInDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efee26ee-0b75-4a40-80b3-1cef1c5a4ba0">
    <name>RoomQuota</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="860bbeda-97f5-4e71-9843-8c52beecca35">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0f7bef0b-3f02-45bd-bf04-1f07ad0da4e1">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="187fbf66-3954-47d0-8c0f-925b11f74ee2">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/InformationRegisters/Расш1_СоставНомерногоФонда/Расш1_СоставНомерногоФонда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_СоставНомерногоФонда</name>
  <resources>
    <name>НомернойФонд</name>
    <type>
      <types>CatalogRef.Расш1_НомерныеФонды</types>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Rooms</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Enums/Sex/Sex.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="022fd2a8-7c7b-40e7-94c6-74119f39a75f">
  <name>Sex</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="ac713765-527a-4cd0-9859-f013de7fbda2">
    <name>Male</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae75d47b-21af-4862-bbe5-1aaeb6286524">
    <name>Female</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Documents/AddRoom/AddRoom.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8b656dee-633d-406a-9c03-d9def325700e">
  <name>AddRoom</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8f316e9e-522f-4ea8-a511-8e394c8f0f91">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a9af351-1ed8-47e8-a4ac-36ccb9a9133b">
    <name>RoomGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4544252-6dc6-4e47-a5ba-9a077088c026">
    <name>RoomNumber</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35d7b095-2084-4ac5-b1c0-53496259e3c0">
    <name>SortCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="94d9082d-081d-4e09-8241-03b5bd703e48">
    <name>NumberOfBedsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61d78b1e-fc72-4b03-bbda-4ac551278501">
    <name>NumberOfPersonsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0dc231c-4c6d-423c-9c13-21128a11e0b6">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="42582061-eefa-4e14-aef3-282e5f7e8213">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c2ae375-5c01-49ac-b86e-b29e738fa70f">
    <name>IsVirtual</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7137f8ea-52d7-42de-8bce-891d9c49f707">
    <name>OperationEndDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2f25bda-a969-4a7c-8153-6e2742fc9d69">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e5dce1b-2144-473e-b535-33b9ac3e3b0b">
    <name>Author</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/DataProcessors/ЗагрузкаДанныхБезЗаселения4Комната/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьСубподрядчиков(Команда)
	
	Если Не ЗначениеЗаполнено(НомерПервойСтроки) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер первой строки";
		Сообщение.Поле = "НомерПервойСтроки";
		Сообщение.Сообщить();		
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КолонкаПодрядчиков) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер колонки с подрядчиками";
		Сообщение.Поле = "КолонкаПодрядчиков";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ПрочитатьСубподрядчиковНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСубподрядчиковНаСервере()
	
	МассивПодрядчиков = Новый Массив;
	
	Для НомерСтроки = НомерПервойСтроки По ТабДок.ВысотаТаблицы Цикл
		
		НаименованиеПодрядчика = ПолучитьЗначениеИзСтроки(НомерСтроки, КолонкаПодрядчиков);
		
		Если Не ПустаяСтрока(НаименованиеПодрядчика) Тогда
			
			Индекс = МассивПодрядчиков.Найти(НаименованиеПодрядчика);
			
			Если Индекс = Неопределено Тогда
				МассивПодрядчиков.Добавить(НаименованиеПодрядчика);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = СоздатьПодрядчиковНаСервере(МассивПодрядчиков);
	
	Если Результат = Неопределено Тогда
		Сообщить("В базе все подрядчики из файла присутствуют.");
	Иначе
		
		Для каждого Элемент Из Результат Цикл
			
			Сообщить("Создан подрядчик " + Элемент);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПодрядчиковНаСервере(МассивПодрядчиков)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расш1_НомерныеФонды.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Расш1_НомерныеФонды КАК Расш1_НомерныеФонды";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Индекс = МассивПодрядчиков.Найти(Выборка.Наименование);
		
		Если Индекс <> Неопределено Тогда
			МассивПодрядчиков.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПодрядчиков.Количество()= 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для каждого Элемент Из МассивПодрядчиков Цикл
		
		СправочникОбъект = Справочники.Расш1_НомерныеФонды.СоздатьЭлемент();
		
		СправочникОбъект.Наименование = Элемент;
		
		СправочникОбъект.Записать();
		
		Результат.Добавить(Элемент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьНомера(Команда)
	
	ОчиститьСообщения();
	
	СоздатьНомераНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНомераНаСервере()
	
	Если Не ЗначениеЗаполнено(Дом) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер дома";
		Сообщение.Поле = "Дом";
		Сообщение.Сообщить();		
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерПервойСтроки) Тогда	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер первой строки";
		Сообщение.Поле = "НомерПервойСтроки";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КолонкаПодрядчиков) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер колонки с подрядчиками";
		Сообщение.Поле = "КолонкаПодрядчиков";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КолонкаКвартиры) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер колонки с квартирами";
		Сообщение.Поле = "КолонкаКвартиры";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(КолонкаКомнат) Тогда		
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не указан номер колонки с комнатами";
	//	Сообщение.Поле = "КолонкаКомнат";
	//	Сообщение.Сообщить();		
	//	Возврат;
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипНомера) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан тип номера";
		Сообщение.Поле = "ТипНомера";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	ПрочитатьДанныеТабДок();
	
	Сообщить("Выполнено");
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьДанныеТабДок()
	
	Гостиница = Дом.Владелец;
	
	ТЗ_Номера = Новый ТаблицаЗначений;
	
	ТЗ_Номера.Колонки.Добавить("Подрядчик", Новый ОписаниеТипов("СправочникСсылка.Расш1_НомерныеФонды"));
	ТЗ_Номера.Колонки.Добавить("Дом", Новый ОписаниеТипов("СправочникСсылка.Rooms"));
	ТЗ_Номера.Колонки.Добавить("Квартира", Новый ОписаниеТипов("Строка"));
	ТЗ_Номера.Колонки.Добавить("Номер", Новый ОписаниеТипов("СправочникСсылка.Rooms"));
	ТЗ_Номера.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
	ТЗ_Номера.Колонки.Добавить("НомерКомнаты", Новый ОписаниеТипов("Строка"));
	
	СоответствиеПодрядчик = Новый Соответствие;
	
	НаименованиеКвартиры = "";
	НаименованиеПодрядчика = "";
	
	Для НомерСтроки = НомерПервойСтроки По ТабДок.ВысотаТаблицы Цикл
		
		НоваяСтрока = ТЗ_Номера.Добавить();
		
		НаименованиеПодрядчикаИзСтроки = ПолучитьЗначениеИзСтроки(НомерСтроки, КолонкаПодрядчиков);
		
		Если Не ПустаяСтрока(НаименованиеПодрядчикаИзСтроки) Тогда		
			НаименованиеПодрядчика = НаименованиеПодрядчикаИзСтроки;
		КонецЕсли;
		
		НаименованиеКвартирыИзСтроки = ПолучитьЗначениеИзСтроки(НомерСтроки, КолонкаКвартиры);
		
		Если Не ПустаяСтрока(НаименованиеКвартирыИзСтроки) Тогда		
			НаименованиеКвартиры = НаименованиеКвартирыИзСтроки;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(НаименованиеПодрядчика) Тогда
			СсылкаПодрядчик = СоответствиеПодрядчик.Получить(НаименованиеПодрядчика);
		Иначе
			СсылкаПодрядчик = Справочники.Расш1_НомерныеФонды.ПустаяСсылка();
		КонецЕсли;
			
		Если СсылкаПодрядчик = Неопределено Тогда
			
			СсылкаПодрядчик = ПолучитьСсылкуПодрядчик(НаименованиеПодрядчика);
			
			Если СсылкаПодрядчик = Неопределено Тогда
				Сообщить("Необходимо сначала создать субподрядчиков. Загрузка будет прервана");
				Возврат Неопределено;
			КонецЕсли;
			
			СоответствиеПодрядчик.Вставить(НаименованиеПодрядчика, СсылкаПодрядчик);
			
		КонецЕсли;
		
		Для НомерКомнаты = 1 По 4 Цикл
			
			НоваяСтрока.Дом = Дом;
			НоваяСтрока.Подрядчик = СсылкаПодрядчик;
			НоваяСтрока.Квартира = НаименованиеКвартиры;
			НоваяСтрока.Счетчик = 1; 
			НоваяСтрока.НомерКомнаты = Строка(НомерКомнаты);
			
			Если НомерКомнаты = 4 Тогда
				СсылкаНомер = ПолучитьСсылкуНаНомер(НаименованиеКвартиры, НоваяСтрока.НомерКомнаты, СсылкаПодрядчик, Истина);
			Иначе
				СсылкаНомер = ПолучитьСсылкуНаНомер(НаименованиеКвартиры, НоваяСтрока.НомерКомнаты, СсылкаПодрядчик, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
		//НомерКомнатыИзСтроки = ПолучитьЗначениеИзСтроки(НомерСтроки, КолонкаКомнат);
		
		//Если Не ПустаяСтрока(НомерКомнатыИзСтроки) Тогда
			
			//НоваяСтрока.Дом = Дом;
			//НоваяСтрока.Подрядчик = СсылкаПодрядчик;
			//НоваяСтрока.Квартира = НаименованиеКвартиры;
			//НоваяСтрока.Счетчик = 1; 
			//НоваяСтрока.НомерКомнаты = НомерКомнатыИзСтроки;
			//
			//СсылкаНомер = ПолучитьСсылкуНаНомер(НаименованиеКвартиры, НомерКомнатыИзСтроки, СсылкаПодрядчик);
			//
			//НоваяСтрока.Номер = СсылкаНомер;
		//Иначе
		//	Продолжить;			
		//КонецЕсли;
		
	КонецЦикла;

	//ТЗ_Итог = ТЗ_Номера.Скопировать();
	//
	//ТЗ_Итог.Свернуть("Подрядчик, Квартира", "Счетчик");
	//
	//Построитель = Новый ПостроительЗапроса;
	//Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ_Итог);
	//
	//тОтбор = Построитель.Отбор.Добавить("Счетчик");
	//тОтбор.ВидСравнения = ВидСравнения.Меньше;
	//тОтбор.Значение = 4;
	//тОтбор.Использование = Истина;
	//	
	//Построитель.Выполнить();	
	//ТабРезультат = Построитель.Результат.Выгрузить();
	//	
	//Для каждого Строка Из ТабРезультат Цикл
	//	
	//	Если Строка.Счетчик = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//			
	//	Для Номер = 4 по 4 Цикл
	//		
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("Квартира", Строка.Квартира);
	//		Отбор.Вставить("НомерКомнаты", Строка(Номер));
	//		
	//		Строки = ТЗ_Номера.НайтиСтроки(Отбор);
	//	
	//		Если Строки.Количество() = 0 Тогда
	//			
	//			ПолучитьСсылкуНаНомер(Строка.Квартира, Строка(Номер), Строка.Подрядчик, Истина);
	//			
	//		КонецЕсли;	
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПроверитьДоступностьНомера(pHotel, pRoomType, pRoom, pDateFrom, pDateTo)
	
	vRoomsVacant = 0;
	
	vQry = New Query();
	vQry.Text = 
	"SELECT Разрешенные
	|	RoomInventoryBalance.Hotel AS Hotel,
	|	RoomInventoryBalance.RoomType AS RoomType,
	|	RoomInventoryBalance.Room AS Room,
	|	MIN(RoomInventoryBalance.CounterClosingBalance) AS CounterClosingBalance,
	|	MIN(RoomInventoryBalance.TotalBedsClosingBalance) AS TotalBeds,
	|	MIN(RoomInventoryBalance.TotalRoomsClosingBalance) AS TotalRooms,
	|	MIN(RoomInventoryBalance.RoomsVacantClosingBalance) AS RoomsVacant,
	|	MIN(RoomInventoryBalance.BedsVacantClosingBalance) AS BedsVacant,
	|	MIN(RoomInventoryBalance.GuestsVacantClosingBalance) AS GuestsVacant
	|FROM
	|	AccumulationRegister.RoomInventory.BalanceAndTurnovers(
	|			&qDateFrom,
	|			&qDateTo,
	|			Second,
	|			RegisterRecordsAndPeriodBoundaries,
	|			Hotel = &qHotel
	|				AND RoomType = &qRoomType
	|				AND Room = &qRoom) AS RoomInventoryBalance
	|
	|GROUP BY
	|	RoomInventoryBalance.Hotel,
	|	RoomInventoryBalance.RoomType,
	|	RoomInventoryBalance.Room";
	
	vQry.SetParameter("qHotel", pHotel);
	vQry.SetParameter("qRoomType", pRoomType);
	vQry.SetParameter("qRoom", pRoom);
	vQry.SetParameter("qDateFrom", pDateFrom);
	vQry.SetParameter("qDateTo", New Boundary(pDateTo, BoundaryType.Excluding));
	
	vQryTab = vQry.Execute().Unload();
	For Each vQryTabRow In vQryTab Do
		vRoomsVacant = vQryTabRow.RoomsVacant;
		Break;
	EndDo;
	
	Если vRoomsVacant <= 0 Тогда	
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция pmCreateGuestGroup()
	
	vGuestGroupObj = Catalogs.GuestGroups.CreateItem();
	vGuestGroupObj.Owner = Гостиница;
	vGuestGroupFolder = Гостиница.GetObject().pmGetGuestGroupFolder();
	If ValueIsFilled(vGuestGroupFolder) Then
		vGuestGroupObj.Parent = vGuestGroupFolder;
		vGuestGroupObj.SetNewCode();
	EndIf;
	vGuestGroupObj.OneCustomerPerGuestGroup = Гостиница.OneCustomerPerGuestGroup;
	vGuestGroupObj.Write();
	// Fill document attribute
	Возврат vGuestGroupObj.Ref;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуСотрудника(Фамилия, Имя, Отчество, ДолжностьСотрудника, НаименованиеПодрядчика, НаименованиеСотрудникаАнгл)
	
	ПолноеИмяСотрудника = Фамилия + " " + Имя + " " + Отчество;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Clients.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Clients КАК Clients
	|ГДЕ
	|	Clients.FullName = &FullName
	|	И Clients.PlaceOfEmployment = &PlaceOfEmployment";
	
	Запрос.УстановитьПараметр("FullName", ПолноеИмяСотрудника);
	Запрос.УстановитьПараметр("PlaceOfEmployment", НаименованиеПодрядчика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		СправочникОбъект = Справочники.Clients.СоздатьЭлемент();
		СправочникОбъект.Position = ДолжностьСотрудника;
		СправочникОбъект.LastName = Фамилия;
		СправочникОбъект.FirstName = Имя;
		СправочникОбъект.SecondName = Отчество;
		СправочникОбъект.PlaceOfEmployment = НаименованиеПодрядчика;
		СправочникОбъект.Sex = Перечисления.Sex.Male;
		СправочникОбъект.ПолноеИмяEng = НаименованиеСотрудникаАнгл;
		СправочникОбъект.Author = SessionParameters.CurrentUser;
		
		СправочникОбъект.Записать();
		
		Возврат СправочникОбъект.Ссылка; 
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаНомер(НаименованиеКвартиры, НомерКомнатыИзСтроки, СсылкаПодрядчик, Виртуальный = Ложь)
	
	НаименованиеНомера = НаименованиеДома + "-" + НаименованиеКвартиры + "/" + НомерКомнатыИзСтроки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Rooms.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Rooms КАК Rooms
	|ГДЕ
	|	Rooms.ЭтоГруппа = Ложь
	|	И Rooms.Наименование = &Наименование
	|	И Rooms.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеНомера);
	Запрос.УстановитьПараметр("Родитель", Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	Иначе
		//СправочникОбъект = Справочники.Rooms.СоздатьГруппу();
		//СправочникОбъект.Наименование = НаименованиеГруппыКвартиры;
		//СправочникОбъект.Родитель = Дом;
		//СправочникОбъект.Владелец = Дом.Владелец;
		//СправочникОбъект.Записать();
		
		//Возврат СправочникОбъект.Ссылка;
		
		ДокументОбъект = Документы.AddRoom.СоздатьДокумент();
		ДокументОбъект.Hotel = Гостиница;
		ДокументОбъект.Дата = НачалоДня(ТекущаяДатаСеанса());
		ДокументОбъект.RoomGroup = Дом;
		ДокументОбъект.НомерКвартиры = НаименованиеКвартиры;
		ДокументОбъект.RoomNumber  = НаименованиеНомера;
		ДокументОбъект.SortCode = УдаляемНечисла(НаименованиеНомера);
		ДокументОбъект.NumberOfBedsPerRoom = 1;
		ДокументОбъект.NumberOfPersonsPerRoom = 2;
		ДокументОбъект.RoomType  = ТипНомера;
		
		Если Виртуальный тогда
			ДокументОбъект.IsVirtual = Истина;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		МенеджерЗаписи = РегистрыСведений.Расш1_СоставНомерногоФонда.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номер = ДокументОбъект.Room;
		МенеджерЗаписи.НомернойФонд = СсылкаПодрядчик;
		
		МенеджерЗаписи.Записать();
		
		Возврат ДокументОбъект.Room;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УдаляемНеЧисла(СтрокаДляРазбора)
	
	ОбработаннаяСтрокаСтр = СокрЛП(СтрокаДляРазбора);
	РезультатРаботы = ОбработаннаяСтрокаСтр;
	
	Для н=1 по СтрДлина(ОбработаннаяСтрокаСтр) Цикл
		ТекСимвол = Сред(ОбработаннаяСтрокаСтр,н,1);
		Если Найти("0123456789",ТекСимвол) = 0 Тогда
			РезультатРаботы = СтрЗаменить(РезультатРаботы, ТекСимвол, ""); 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат РезультатРаботы;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеИзСтроки(НомерСтроки, Колонка)
	
	Возврат СокрЛП(ТабДок.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(Колонка,"ЧГ=")).Текст)
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуКвартира(НаименованиеКвартиры)
	
	НаименованиеГруппыКвартиры = "кв." + НаименованиеКвартиры;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Rooms.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Rooms КАК Rooms
	|ГДЕ
	|	Rooms.ЭтоГруппа = ИСТИНА
	|	И Rooms.Наименование = &Наименование
	|	И Rooms.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеГруппыКвартиры);
	Запрос.УстановитьПараметр("Родитель", Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	Иначе
		СправочникОбъект = Справочники.Rooms.СоздатьГруппу();
		СправочникОбъект.Наименование = НаименованиеГруппыКвартиры;
		СправочникОбъект.Родитель = Дом;
		СправочникОбъект.Владелец = Гостиница;
		СправочникОбъект.Записать();
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуПодрядчик(НаименованиеПодрядчика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расш1_НомерныеФонды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Расш1_НомерныеФонды КАК Расш1_НомерныеФонды
	|ГДЕ
	|	Расш1_НомерныеФонды.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеПодрядчика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	НаименованиеДома = ПолучитьНаименованиеДома();
	
	ВхождениеПервойСкобки = СтрНайти(НаименованиеДома,"(");
	
	Если ВхождениеПервойСкобки > 0 Тогда
		НаименованиеДома = Лев(НаименованиеДома, ВхождениеПервойСкобки -1);
	КонецЕсли;
	
	ОчиститьТабДокНаСервере();
	
КонецПроцедуры

Процедура ОчиститьТабДокНаСервере()
	ТабДок.Очистить();	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеДома()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Rooms.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Rooms КАК Rooms
	|ГДЕ
	|	Rooms.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КолонкаДолжностей = 6;
	КолонкаСотрудников = 5;
	КолонкаКомнат = 4;
	КолонкаКвартиры =3;
	КолонкаПодрядчиков = 2;
	НомерПервойСтроки = 1;
	
КонецПроцедуры
